konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/qmi.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
# =============================================================================
# Register block : QMI
# Version        : 1
# Bus type       : apb
# Description    : QSPI Memory Interface.
#
#                  Provides a memory-mapped interface to up to two
#                  SPI/DSPI/QSPI flash or PSRAM devices. Also provides a serial
#                  interface for programming and configuration of the external
#                  device.
# =============================================================================
.ifndef	_HARDWARE_REGS_QMI_H
.set	_HARDWARE_REGS_QMI_H, 1
# =============================================================================
# Register    : QMI_DIRECT_CSR
# Description : Control and status for direct serial mode
#
#               Direct serial mode allows the processor to send and receive raw
#               serial frames, for programming, configuration and control of
#               the external memory devices. Only SPI mode 0 (CPOL=0 CPHA=0) is
#               supported.
.equ	QMI_DIRECT_CSR_OFFSET, 0x00000000
.equ	QMI_DIRECT_CSR_BITS, 0xffdf7ccf
.equ	QMI_DIRECT_CSR_RESET, 0x01800000
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_CSR_RXDELAY
# Description : Delay the read data sample timing, in units of one half of a
#               system clock cycle. (Not necessarily half of an SCK cycle.)
.equ	QMI_DIRECT_CSR_RXDELAY_RESET, 0x0
.equ	QMI_DIRECT_CSR_RXDELAY_BITS, 0xc0000000
.equ	QMI_DIRECT_CSR_RXDELAY_MSB, 31
.equ	QMI_DIRECT_CSR_RXDELAY_LSB, 30
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_CSR_CLKDIV
# Description : Clock divisor for direct serial mode. Divisors of 1..255 are
#               encoded directly, and the maximum divisor of 256 is encoded by
#               a value of CLKDIV=0.
#
#               The clock divisor can be changed on-the-fly by software,
#               without halting or otherwise coordinating with the serial
#               interface. The serial interface will sample the latest clock
#               divisor each time it begins the transmission of a new byte.
.equ	QMI_DIRECT_CSR_CLKDIV_RESET, 0x06
.equ	QMI_DIRECT_CSR_CLKDIV_BITS, 0x3fc00000
.equ	QMI_DIRECT_CSR_CLKDIV_MSB, 29
.equ	QMI_DIRECT_CSR_CLKDIV_LSB, 22
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_CSR_RXLEVEL
# Description : Current level of DIRECT_RX FIFO
.equ	QMI_DIRECT_CSR_RXLEVEL_RESET, 0x0
.equ	QMI_DIRECT_CSR_RXLEVEL_BITS, 0x001c0000
.equ	QMI_DIRECT_CSR_RXLEVEL_MSB, 20
.equ	QMI_DIRECT_CSR_RXLEVEL_LSB, 18
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_CSR_RXFULL
# Description : When 1, the DIRECT_RX FIFO is currently full. The serial
#               interface will be stalled until data is popped; the interface
#               will not begin a new serial frame when the DIRECT_TX FIFO is
#               empty or the DIRECT_RX FIFO is full.
.equ	QMI_DIRECT_CSR_RXFULL_RESET, 0x0
.equ	QMI_DIRECT_CSR_RXFULL_BITS, 0x00020000
.equ	QMI_DIRECT_CSR_RXFULL_MSB, 17
.equ	QMI_DIRECT_CSR_RXFULL_LSB, 17
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_CSR_RXEMPTY
# Description : When 1, the DIRECT_RX FIFO is currently empty. If the processor
#               attempts to read more data, the FIFO state is not affected, but
#               the value returned to the processor is undefined.
.equ	QMI_DIRECT_CSR_RXEMPTY_RESET, 0x0
.equ	QMI_DIRECT_CSR_RXEMPTY_BITS, 0x00010000
.equ	QMI_DIRECT_CSR_RXEMPTY_MSB, 16
.equ	QMI_DIRECT_CSR_RXEMPTY_LSB, 16
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_CSR_TXLEVEL
# Description : Current level of DIRECT_TX FIFO
.equ	QMI_DIRECT_CSR_TXLEVEL_RESET, 0x0
.equ	QMI_DIRECT_CSR_TXLEVEL_BITS, 0x00007000
.equ	QMI_DIRECT_CSR_TXLEVEL_MSB, 14
.equ	QMI_DIRECT_CSR_TXLEVEL_LSB, 12
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_CSR_TXEMPTY
# Description : When 1, the DIRECT_TX FIFO is currently empty. Unless the
#               processor pushes more data, transmission will stop and BUSY
#               will go low once the current 8-bit serial frame completes.
.equ	QMI_DIRECT_CSR_TXEMPTY_RESET, 0x0
.equ	QMI_DIRECT_CSR_TXEMPTY_BITS, 0x00000800
.equ	QMI_DIRECT_CSR_TXEMPTY_MSB, 11
.equ	QMI_DIRECT_CSR_TXEMPTY_LSB, 11
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_CSR_TXFULL
# Description : When 1, the DIRECT_TX FIFO is currently full. If the processor
#               tries to write more data, that data will be ignored.
.equ	QMI_DIRECT_CSR_TXFULL_RESET, 0x0
.equ	QMI_DIRECT_CSR_TXFULL_BITS, 0x00000400
.equ	QMI_DIRECT_CSR_TXFULL_MSB, 10
.equ	QMI_DIRECT_CSR_TXFULL_LSB, 10
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_CSR_AUTO_CS1N
# Description : When 1, automatically assert the CS1n chip select line whenever
#               the BUSY flag is set.
.equ	QMI_DIRECT_CSR_AUTO_CS1N_RESET, 0x0
.equ	QMI_DIRECT_CSR_AUTO_CS1N_BITS, 0x00000080
.equ	QMI_DIRECT_CSR_AUTO_CS1N_MSB, 7
.equ	QMI_DIRECT_CSR_AUTO_CS1N_LSB, 7
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_CSR_AUTO_CS0N
# Description : When 1, automatically assert the CS0n chip select line whenever
#               the BUSY flag is set.
.equ	QMI_DIRECT_CSR_AUTO_CS0N_RESET, 0x0
.equ	QMI_DIRECT_CSR_AUTO_CS0N_BITS, 0x00000040
.equ	QMI_DIRECT_CSR_AUTO_CS0N_MSB, 6
.equ	QMI_DIRECT_CSR_AUTO_CS0N_LSB, 6
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_CSR_ASSERT_CS1N
# Description : When 1, assert (i.e. drive low) the CS1n chip select line.
#
#               Note that this applies even when DIRECT_CSR_EN is 0.
.equ	QMI_DIRECT_CSR_ASSERT_CS1N_RESET, 0x0
.equ	QMI_DIRECT_CSR_ASSERT_CS1N_BITS, 0x00000008
.equ	QMI_DIRECT_CSR_ASSERT_CS1N_MSB, 3
.equ	QMI_DIRECT_CSR_ASSERT_CS1N_LSB, 3
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_CSR_ASSERT_CS0N
# Description : When 1, assert (i.e. drive low) the CS0n chip select line.
#
#               Note that this applies even when DIRECT_CSR_EN is 0.
.equ	QMI_DIRECT_CSR_ASSERT_CS0N_RESET, 0x0
.equ	QMI_DIRECT_CSR_ASSERT_CS0N_BITS, 0x00000004
.equ	QMI_DIRECT_CSR_ASSERT_CS0N_MSB, 2
.equ	QMI_DIRECT_CSR_ASSERT_CS0N_LSB, 2
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_CSR_BUSY
# Description : Direct mode busy flag. If 1, data is currently being shifted
#               in/out (or would be if the interface were not stalled on the RX
#               FIFO), and the chip select must not yet be deasserted.
#
#               The busy flag will also be set to 1 if a memory-mapped transfer
#               is still in progress when direct mode is enabled. Direct mode
#               blocks new memory-mapped transfers, but can't halt a transfer
#               that is already in progress. If there is a chance that memory-
#               mapped transfers may be in progress, the busy flag should be
#               polled for 0 before asserting the chip select.
#
#               (In practice you will usually discover this timing condition
#               through other means, because any subsequent memory-mapped
#               transfers when direct mode is enabled will return bus errors,
#               which are difficult to ignore.)
.equ	QMI_DIRECT_CSR_BUSY_RESET, 0x0
.equ	QMI_DIRECT_CSR_BUSY_BITS, 0x00000002
.equ	QMI_DIRECT_CSR_BUSY_MSB, 1
.equ	QMI_DIRECT_CSR_BUSY_LSB, 1
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_CSR_EN
# Description : Enable direct mode.
#
#               In direct mode, software controls the chip select lines, and
#               can perform direct SPI transfers by pushing data to the
#               DIRECT_TX FIFO, and popping the same amount of data from the
#               DIRECT_RX FIFO.
#
#               Memory-mapped accesses will generate bus errors when direct
#               serial mode is enabled.
.equ	QMI_DIRECT_CSR_EN_RESET, 0x0
.equ	QMI_DIRECT_CSR_EN_BITS, 0x00000001
.equ	QMI_DIRECT_CSR_EN_MSB, 0
.equ	QMI_DIRECT_CSR_EN_LSB, 0
# =============================================================================
# Register    : QMI_DIRECT_TX
# Description : Transmit FIFO for direct mode
.equ	QMI_DIRECT_TX_OFFSET, 0x00000004
.equ	QMI_DIRECT_TX_BITS, 0x001fffff
.equ	QMI_DIRECT_TX_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_TX_NOPUSH
# Description : Inhibit the RX FIFO push that would correspond to this TX FIFO
#               entry.
#
#               Useful to avoid garbage appearing in the RX FIFO when pushing
#               the command at the beginning of a SPI transfer.
.equ	QMI_DIRECT_TX_NOPUSH_RESET, 0x0
.equ	QMI_DIRECT_TX_NOPUSH_BITS, 0x00100000
.equ	QMI_DIRECT_TX_NOPUSH_MSB, 20
.equ	QMI_DIRECT_TX_NOPUSH_LSB, 20
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_TX_OE
# Description : Output enable (active-high). For single width (SPI), this field
#               is ignored, and SD0 is always set to output, with SD1 always
#               set to input.
#
#               For dual and quad width (DSPI/QSPI), this sets whether the
#               relevant SDx pads are set to output whilst transferring this
#               FIFO record. In this case the command/address should have OE
#               set, and the data transfer should have OE set or clear
#               depending on the direction of the transfer.
.equ	QMI_DIRECT_TX_OE_RESET, 0x0
.equ	QMI_DIRECT_TX_OE_BITS, 0x00080000
.equ	QMI_DIRECT_TX_OE_MSB, 19
.equ	QMI_DIRECT_TX_OE_LSB, 19
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_TX_DWIDTH
# Description : Data width. If 0, hardware will transmit the 8 LSBs of the
#               DIRECT_TX DATA field, and return an 8-bit value in the 8 LSBs
#               of DIRECT_RX. If 1, the full 16-bit width is used. 8-bit and
#               16-bit transfers can be mixed freely.
.equ	QMI_DIRECT_TX_DWIDTH_RESET, 0x0
.equ	QMI_DIRECT_TX_DWIDTH_BITS, 0x00040000
.equ	QMI_DIRECT_TX_DWIDTH_MSB, 18
.equ	QMI_DIRECT_TX_DWIDTH_LSB, 18
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_TX_IWIDTH
# Description : Configure whether this FIFO record is transferred with
#               single/dual/quad interface width (0/1/2). Different widths can
#               be mixed freely.
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_DIRECT_TX_IWIDTH_RESET, 0x0
.equ	QMI_DIRECT_TX_IWIDTH_BITS, 0x00030000
.equ	QMI_DIRECT_TX_IWIDTH_MSB, 17
.equ	QMI_DIRECT_TX_IWIDTH_LSB, 16
.equ	QMI_DIRECT_TX_IWIDTH_VALUE_S, 0x0
.equ	QMI_DIRECT_TX_IWIDTH_VALUE_D, 0x1
.equ	QMI_DIRECT_TX_IWIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_DIRECT_TX_DATA
# Description : Data pushed here will be clocked out falling edges of SCK (or
#               before the very first rising edge of SCK, if this is the first
#               pulse). For each byte clocked out, the interface will
#               simultaneously sample one byte, on rising edges of SCK, and
#               push this to the DIRECT_RX FIFO.
#
#               For 16-bit data, the least-significant byte is transmitted
#               first.
.equ	QMI_DIRECT_TX_DATA_RESET, 0x0000
.equ	QMI_DIRECT_TX_DATA_BITS, 0x0000ffff
.equ	QMI_DIRECT_TX_DATA_MSB, 15
.equ	QMI_DIRECT_TX_DATA_LSB, 0
# =============================================================================
# Register    : QMI_DIRECT_RX
# Description : Receive FIFO for direct mode
#               With each byte clocked out on the serial interface, one byte
#               will simultaneously be clocked in, and will appear in this
#               FIFO. The serial interface will stall when this FIFO is full,
#               to avoid dropping data.
#
#               When 16-bit data is pushed into the TX FIFO, the corresponding
#               RX FIFO push will also contain 16 bits of data. The least-
#               significant byte is the first one received.
.equ	QMI_DIRECT_RX_OFFSET, 0x00000008
.equ	QMI_DIRECT_RX_BITS, 0x0000ffff
.equ	QMI_DIRECT_RX_RESET, 0x00000000
.equ	QMI_DIRECT_RX_MSB, 15
.equ	QMI_DIRECT_RX_LSB, 0
# =============================================================================
# Register    : QMI_M0_TIMING
# Description : Timing configuration register for memory address window 0.
.equ	QMI_M0_TIMING_OFFSET, 0x0000000c
.equ	QMI_M0_TIMING_BITS, 0xf3fff7ff
.equ	QMI_M0_TIMING_RESET, 0x40000004
# -----------------------------------------------------------------------------
# Field       : QMI_M0_TIMING_COOLDOWN
# Description : Chip select cooldown period. When a memory transfer finishes,
#               the chip select remains asserted for 64 x COOLDOWN system clock
#               cycles, plus half an SCK clock period (rounded up for odd SCK
#               divisors). After this cooldown expires, the chip select is
#               always deasserted to save power.
#
#               If the next memory access arrives within the cooldown period,
#               the QMI may be able to append more SCK cycles to the currently
#               ongoing SPI transfer, rather than starting a new transfer. This
#               reduces access latency and increases bus throughput.
#
#               Specifically, the next access must be in the same direction
#               (read/write), access the same memory window (chip select 0/1),
#               and follow sequentially the address of the last transfer. If
#               any of these are false, the new access will first deassert the
#               chip select, then begin a new transfer.
#
#               If COOLDOWN is 0, the address alignment configured by PAGEBREAK
#               has been reached, or the total chip select assertion limit
#               MAX_SELECT has been reached, the cooldown period is skipped,
#               and the chip select will always be deasserted one half SCK
#               period after the transfer finishes.
.equ	QMI_M0_TIMING_COOLDOWN_RESET, 0x1
.equ	QMI_M0_TIMING_COOLDOWN_BITS, 0xc0000000
.equ	QMI_M0_TIMING_COOLDOWN_MSB, 31
.equ	QMI_M0_TIMING_COOLDOWN_LSB, 30
# -----------------------------------------------------------------------------
# Field       : QMI_M0_TIMING_PAGEBREAK
# Description : When page break is enabled, chip select will automatically
#               deassert when crossing certain power-of-2-aligned address
#               boundaries. The next access will always begin a new read/write
#               SPI burst, even if the address of the next access follows in
#               sequence with the last access before the page boundary.
#
#               Some flash and PSRAM devices forbid crossing page boundaries
#               with a single read/write transfer, or restrict the operating
#               frequency for transfers that do cross page a boundary. This
#               option allows the QMI to safely support those devices.
#
#               This field has no effect when COOLDOWN is disabled.
#               0x0 -> No page boundary is enforced
#               0x1 -> Break bursts crossing a 256-byte page boundary
#               0x2 -> Break bursts crossing a 1024-byte quad-page boundary
#               0x3 -> Break bursts crossing a 4096-byte sector boundary
.equ	QMI_M0_TIMING_PAGEBREAK_RESET, 0x0
.equ	QMI_M0_TIMING_PAGEBREAK_BITS, 0x30000000
.equ	QMI_M0_TIMING_PAGEBREAK_MSB, 29
.equ	QMI_M0_TIMING_PAGEBREAK_LSB, 28
.equ	QMI_M0_TIMING_PAGEBREAK_VALUE_NONE, 0x0
.equ	QMI_M0_TIMING_PAGEBREAK_VALUE_256, 0x1
.equ	QMI_M0_TIMING_PAGEBREAK_VALUE_1024, 0x2
.equ	QMI_M0_TIMING_PAGEBREAK_VALUE_4096, 0x3
# -----------------------------------------------------------------------------
# Field       : QMI_M0_TIMING_SELECT_SETUP
# Description : Add up to one additional system clock cycle of setup between
#               chip select assertion and the first rising edge of SCK.
#
#               The default setup time is one half SCK period, which is usually
#               sufficient except for very high SCK frequencies with some flash
#               devices.
.equ	QMI_M0_TIMING_SELECT_SETUP_RESET, 0x0
.equ	QMI_M0_TIMING_SELECT_SETUP_BITS, 0x02000000
.equ	QMI_M0_TIMING_SELECT_SETUP_MSB, 25
.equ	QMI_M0_TIMING_SELECT_SETUP_LSB, 25
# -----------------------------------------------------------------------------
# Field       : QMI_M0_TIMING_SELECT_HOLD
# Description : Add up to three additional system clock cycles of active hold
#               between the last falling edge of SCK and the deassertion of
#               this window's chip select.
#
#               The default hold time is one system clock cycle. Note that
#               flash datasheets usually give chip select active hold time from
#               the last *rising* edge of SCK, and so even zero hold from the
#               last falling edge would be safe.
#
#               Note that this is a minimum hold time guaranteed by the QMI:
#               the actual chip select active hold may be slightly longer for
#               read transfers with low clock divisors and/or high sample
#               delays. Specifically, if the point two cycles after the last RX
#               data sample is later than the last SCK falling edge, then the
#               hold time is measured from *this* point.
#
#               Note also that, in case the final SCK pulse is masked to save
#               energy (true for non-DTR reads when COOLDOWN is disabled or
#               PAGE_BREAK is reached), all of QMI's timing logic behaves as
#               though the clock pulse were still present. The SELECT_HOLD time
#               is applied from the point where the last SCK falling edge would
#               be if the clock pulse were not masked.
.equ	QMI_M0_TIMING_SELECT_HOLD_RESET, 0x0
.equ	QMI_M0_TIMING_SELECT_HOLD_BITS, 0x01800000
.equ	QMI_M0_TIMING_SELECT_HOLD_MSB, 24
.equ	QMI_M0_TIMING_SELECT_HOLD_LSB, 23
# -----------------------------------------------------------------------------
# Field       : QMI_M0_TIMING_MAX_SELECT
# Description : Enforce a maximum assertion duration for this window's chip
#               select, in units of 64 system clock cycles. If 0, the QMI is
#               permitted to keep the chip select asserted indefinitely when
#               servicing sequential memory accesses (see COOLDOWN).
#
#               This feature is required to meet timing constraints of PSRAM
#               devices, which specify a maximum chip select assertion so they
#               can perform DRAM refresh cycles. See also MIN_DESELECT, which
#               can enforce a minimum deselect time.
#
#               If a memory access is in progress at the time MAX_SELECT is
#               reached, the QMI will wait for the access to complete before
#               deasserting the chip select. This additional time must be
#               accounted for to calculate a safe MAX_SELECT value. In the
#               worst case, this may be a fully-formed serial transfer,
#               including command prefix and address, with a data payload as
#               large as one cache line.
.equ	QMI_M0_TIMING_MAX_SELECT_RESET, 0x00
.equ	QMI_M0_TIMING_MAX_SELECT_BITS, 0x007e0000
.equ	QMI_M0_TIMING_MAX_SELECT_MSB, 22
.equ	QMI_M0_TIMING_MAX_SELECT_LSB, 17
# -----------------------------------------------------------------------------
# Field       : QMI_M0_TIMING_MIN_DESELECT
# Description : After this window's chip select is deasserted, it remains
#               deasserted for half an SCK cycle (rounded up to an integer
#               number of system clock cycles), plus MIN_DESELECT additional
#               system clock cycles, before the QMI reasserts either chip
#               select pin.
#
#               Nonzero values may be required for PSRAM devices which enforce
#               a longer minimum CS deselect time, so that they can perform
#               internal DRAM refresh cycles whilst deselected.
.equ	QMI_M0_TIMING_MIN_DESELECT_RESET, 0x00
.equ	QMI_M0_TIMING_MIN_DESELECT_BITS, 0x0001f000
.equ	QMI_M0_TIMING_MIN_DESELECT_MSB, 16
.equ	QMI_M0_TIMING_MIN_DESELECT_LSB, 12
# -----------------------------------------------------------------------------
# Field       : QMI_M0_TIMING_RXDELAY
# Description : Delay the read data sample timing, in units of one half of a
#               system clock cycle. (Not necessarily half of an SCK cycle.) An
#               RXDELAY of 0 means the sample is captured at the SDI input
#               registers simultaneously with the rising edge of SCK launched
#               from the SCK output register.
#
#               At higher SCK frequencies, RXDELAY may need to be increased to
#               account for the round trip delay of the pads, and the clock-
#               to-Q delay of the QSPI memory device.
.equ	QMI_M0_TIMING_RXDELAY_RESET, 0x0
.equ	QMI_M0_TIMING_RXDELAY_BITS, 0x00000700
.equ	QMI_M0_TIMING_RXDELAY_MSB, 10
.equ	QMI_M0_TIMING_RXDELAY_LSB, 8
# -----------------------------------------------------------------------------
# Field       : QMI_M0_TIMING_CLKDIV
# Description : Clock divisor. Odd and even divisors are supported. Defines the
#               SCK clock period in units of 1 system clock cycle. Divisors
#               1..255 are encoded directly, and a divisor of 256 is encoded
#               with a value of CLKDIV=0.
#
#               The clock divisor can be changed on-the-fly, even when the QMI
#               is currently accessing memory in this address window. All other
#               parameters must only be changed when the QMI is idle.
#
#               If software is increasing CLKDIV in anticipation of an increase
#               in the system clock frequency, a dummy access to either memory
#               window (and appropriate processor barriers/fences) must be
#               inserted after the Mx_TIMING write to ensure the SCK divisor
#               change is in effect _before_ the system clock is changed.
.equ	QMI_M0_TIMING_CLKDIV_RESET, 0x04
.equ	QMI_M0_TIMING_CLKDIV_BITS, 0x000000ff
.equ	QMI_M0_TIMING_CLKDIV_MSB, 7
.equ	QMI_M0_TIMING_CLKDIV_LSB, 0
# =============================================================================
# Register    : QMI_M0_RFMT
# Description : Read transfer format configuration for memory address window 0.
#
#               Configure the bus width of each transfer phase individually,
#               and configure the length or presence of the command prefix,
#               command suffix and dummy/turnaround transfer phases. Only
#               24-bit addresses are supported.
#
#               The reset value of the M0_RFMT register is configured to
#               support a basic 03h serial read transfer with no additional
#               configuration.
.equ	QMI_M0_RFMT_OFFSET, 0x00000010
.equ	QMI_M0_RFMT_BITS, 0x1007d3ff
.equ	QMI_M0_RFMT_RESET, 0x00001000
# -----------------------------------------------------------------------------
# Field       : QMI_M0_RFMT_DTR
# Description : Enable double transfer rate (DTR) for read commands: address,
#               suffix and read data phases are active on both edges of SCK.
