konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/qmi.inc
#               SDO data is launched centre-aligned on each SCK edge, and SDI
#               data is captured on the SCK edge that follows its launch.
#
#               DTR is implemented by halving the clock rate; SCK has a period
#               of 2 x CLK_DIV throughout the transfer. The prefix and dummy
#               phases are still single transfer rate.
#
#               If the suffix is quad-width, it must be 0 or 8 bits in length,
#               to ensure an even number of SCK edges.
.equ	QMI_M0_RFMT_DTR_RESET, 0x0
.equ	QMI_M0_RFMT_DTR_BITS, 0x10000000
.equ	QMI_M0_RFMT_DTR_MSB, 28
.equ	QMI_M0_RFMT_DTR_LSB, 28
# -----------------------------------------------------------------------------
# Field       : QMI_M0_RFMT_DUMMY_LEN
# Description : Length of dummy phase between command suffix and data phase, in
#               units of 4 bits. (i.e. 1 cycle for quad width, 2 for dual, 4
#               for single)
#               0x0 -> No dummy phase
#               0x1 -> 4 dummy bits
#               0x2 -> 8 dummy bits
#               0x3 -> 12 dummy bits
#               0x4 -> 16 dummy bits
#               0x5 -> 20 dummy bits
#               0x6 -> 24 dummy bits
#               0x7 -> 28 dummy bits
.equ	QMI_M0_RFMT_DUMMY_LEN_RESET, 0x0
.equ	QMI_M0_RFMT_DUMMY_LEN_BITS, 0x00070000
.equ	QMI_M0_RFMT_DUMMY_LEN_MSB, 18
.equ	QMI_M0_RFMT_DUMMY_LEN_LSB, 16
.equ	QMI_M0_RFMT_DUMMY_LEN_VALUE_NONE, 0x0
.equ	QMI_M0_RFMT_DUMMY_LEN_VALUE_4, 0x1
.equ	QMI_M0_RFMT_DUMMY_LEN_VALUE_8, 0x2
.equ	QMI_M0_RFMT_DUMMY_LEN_VALUE_12, 0x3
.equ	QMI_M0_RFMT_DUMMY_LEN_VALUE_16, 0x4
.equ	QMI_M0_RFMT_DUMMY_LEN_VALUE_20, 0x5
.equ	QMI_M0_RFMT_DUMMY_LEN_VALUE_24, 0x6
.equ	QMI_M0_RFMT_DUMMY_LEN_VALUE_28, 0x7
# -----------------------------------------------------------------------------
# Field       : QMI_M0_RFMT_SUFFIX_LEN
# Description : Length of post-address command suffix, in units of 4 bits.
#               (i.e. 1 cycle for quad width, 2 for dual, 4 for single)
#
#               Only values of 0 and 8 bits are supported.
#               0x0 -> No suffix
#               0x2 -> 8-bit suffix
.equ	QMI_M0_RFMT_SUFFIX_LEN_RESET, 0x0
.equ	QMI_M0_RFMT_SUFFIX_LEN_BITS, 0x0000c000
.equ	QMI_M0_RFMT_SUFFIX_LEN_MSB, 15
.equ	QMI_M0_RFMT_SUFFIX_LEN_LSB, 14
.equ	QMI_M0_RFMT_SUFFIX_LEN_VALUE_NONE, 0x0
.equ	QMI_M0_RFMT_SUFFIX_LEN_VALUE_8, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M0_RFMT_PREFIX_LEN
# Description : Length of command prefix, in units of 8 bits. (i.e. 2 cycles
#               for quad width, 4 for dual, 8 for single)
#               0x0 -> No prefix
#               0x1 -> 8-bit prefix
.equ	QMI_M0_RFMT_PREFIX_LEN_RESET, 0x1
.equ	QMI_M0_RFMT_PREFIX_LEN_BITS, 0x00001000
.equ	QMI_M0_RFMT_PREFIX_LEN_MSB, 12
.equ	QMI_M0_RFMT_PREFIX_LEN_LSB, 12
.equ	QMI_M0_RFMT_PREFIX_LEN_VALUE_NONE, 0x0
.equ	QMI_M0_RFMT_PREFIX_LEN_VALUE_8, 0x1
# -----------------------------------------------------------------------------
# Field       : QMI_M0_RFMT_DATA_WIDTH
# Description : The width used for the data transfer
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M0_RFMT_DATA_WIDTH_RESET, 0x0
.equ	QMI_M0_RFMT_DATA_WIDTH_BITS, 0x00000300
.equ	QMI_M0_RFMT_DATA_WIDTH_MSB, 9
.equ	QMI_M0_RFMT_DATA_WIDTH_LSB, 8
.equ	QMI_M0_RFMT_DATA_WIDTH_VALUE_S, 0x0
.equ	QMI_M0_RFMT_DATA_WIDTH_VALUE_D, 0x1
.equ	QMI_M0_RFMT_DATA_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M0_RFMT_DUMMY_WIDTH
# Description : The width used for the dummy phase, if any.
#
#               If width is single, SD0/MOSI is held asserted low during the
#               dummy phase, and SD1...SD3 are tristated. If width is
#               dual/quad, all IOs are tristated during the dummy phase.
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M0_RFMT_DUMMY_WIDTH_RESET, 0x0
.equ	QMI_M0_RFMT_DUMMY_WIDTH_BITS, 0x000000c0
.equ	QMI_M0_RFMT_DUMMY_WIDTH_MSB, 7
.equ	QMI_M0_RFMT_DUMMY_WIDTH_LSB, 6
.equ	QMI_M0_RFMT_DUMMY_WIDTH_VALUE_S, 0x0
.equ	QMI_M0_RFMT_DUMMY_WIDTH_VALUE_D, 0x1
.equ	QMI_M0_RFMT_DUMMY_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M0_RFMT_SUFFIX_WIDTH
# Description : The width used for the post-address command suffix, if any
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M0_RFMT_SUFFIX_WIDTH_RESET, 0x0
.equ	QMI_M0_RFMT_SUFFIX_WIDTH_BITS, 0x00000030
.equ	QMI_M0_RFMT_SUFFIX_WIDTH_MSB, 5
.equ	QMI_M0_RFMT_SUFFIX_WIDTH_LSB, 4
.equ	QMI_M0_RFMT_SUFFIX_WIDTH_VALUE_S, 0x0
.equ	QMI_M0_RFMT_SUFFIX_WIDTH_VALUE_D, 0x1
.equ	QMI_M0_RFMT_SUFFIX_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M0_RFMT_ADDR_WIDTH
# Description : The transfer width used for the address. The address phase
#               always transfers 24 bits in total.
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M0_RFMT_ADDR_WIDTH_RESET, 0x0
.equ	QMI_M0_RFMT_ADDR_WIDTH_BITS, 0x0000000c
.equ	QMI_M0_RFMT_ADDR_WIDTH_MSB, 3
.equ	QMI_M0_RFMT_ADDR_WIDTH_LSB, 2
.equ	QMI_M0_RFMT_ADDR_WIDTH_VALUE_S, 0x0
.equ	QMI_M0_RFMT_ADDR_WIDTH_VALUE_D, 0x1
.equ	QMI_M0_RFMT_ADDR_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M0_RFMT_PREFIX_WIDTH
# Description : The transfer width used for the command prefix, if any
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M0_RFMT_PREFIX_WIDTH_RESET, 0x0
.equ	QMI_M0_RFMT_PREFIX_WIDTH_BITS, 0x00000003
.equ	QMI_M0_RFMT_PREFIX_WIDTH_MSB, 1
.equ	QMI_M0_RFMT_PREFIX_WIDTH_LSB, 0
.equ	QMI_M0_RFMT_PREFIX_WIDTH_VALUE_S, 0x0
.equ	QMI_M0_RFMT_PREFIX_WIDTH_VALUE_D, 0x1
.equ	QMI_M0_RFMT_PREFIX_WIDTH_VALUE_Q, 0x2
# =============================================================================
# Register    : QMI_M0_RCMD
# Description : Command constants used for reads from memory address window 0.
#
#               The reset value of the M0_RCMD register is configured to
#               support a basic 03h serial read transfer with no additional
#               configuration.
.equ	QMI_M0_RCMD_OFFSET, 0x00000014
.equ	QMI_M0_RCMD_BITS, 0x0000ffff
.equ	QMI_M0_RCMD_RESET, 0x0000a003
# -----------------------------------------------------------------------------
# Field       : QMI_M0_RCMD_SUFFIX
# Description : The command suffix bits following the address, if
#               Mx_RFMT_SUFFIX_LEN is nonzero.
.equ	QMI_M0_RCMD_SUFFIX_RESET, 0xa0
.equ	QMI_M0_RCMD_SUFFIX_BITS, 0x0000ff00
.equ	QMI_M0_RCMD_SUFFIX_MSB, 15
.equ	QMI_M0_RCMD_SUFFIX_LSB, 8
# -----------------------------------------------------------------------------
# Field       : QMI_M0_RCMD_PREFIX
# Description : The command prefix bits to prepend on each new transfer, if
#               Mx_RFMT_PREFIX_LEN is nonzero.
.equ	QMI_M0_RCMD_PREFIX_RESET, 0x03
.equ	QMI_M0_RCMD_PREFIX_BITS, 0x000000ff
.equ	QMI_M0_RCMD_PREFIX_MSB, 7
.equ	QMI_M0_RCMD_PREFIX_LSB, 0
# =============================================================================
# Register    : QMI_M0_WFMT
# Description : Write transfer format configuration for memory address window
#               0.
#
#               Configure the bus width of each transfer phase individually,
#               and configure the length or presence of the command prefix,
#               command suffix and dummy/turnaround transfer phases. Only
#               24-bit addresses are supported.
#
#               The reset value of the M0_WFMT register is configured to
#               support a basic 02h serial write transfer. However, writes to
#               this window must first be enabled via the XIP_CTRL_WRITABLE_M0
#               bit, as XIP memory is read-only by default.
.equ	QMI_M0_WFMT_OFFSET, 0x00000018
.equ	QMI_M0_WFMT_BITS, 0x1007d3ff
.equ	QMI_M0_WFMT_RESET, 0x00001000
# -----------------------------------------------------------------------------
# Field       : QMI_M0_WFMT_DTR
# Description : Enable double transfer rate (DTR) for write commands: address,
#               suffix and write data phases are active on both edges of SCK.
#               SDO data is launched centre-aligned on each SCK edge, and SDI
#               data is captured on the SCK edge that follows its launch.
#
#               DTR is implemented by halving the clock rate; SCK has a period
#               of 2 x CLK_DIV throughout the transfer. The prefix and dummy
#               phases are still single transfer rate.
#
#               If the suffix is quad-width, it must be 0 or 8 bits in length,
#               to ensure an even number of SCK edges.
.equ	QMI_M0_WFMT_DTR_RESET, 0x0
.equ	QMI_M0_WFMT_DTR_BITS, 0x10000000
.equ	QMI_M0_WFMT_DTR_MSB, 28
.equ	QMI_M0_WFMT_DTR_LSB, 28
# -----------------------------------------------------------------------------
# Field       : QMI_M0_WFMT_DUMMY_LEN
# Description : Length of dummy phase between command suffix and data phase, in
#               units of 4 bits. (i.e. 1 cycle for quad width, 2 for dual, 4
#               for single)
#               0x0 -> No dummy phase
#               0x1 -> 4 dummy bits
#               0x2 -> 8 dummy bits
#               0x3 -> 12 dummy bits
#               0x4 -> 16 dummy bits
#               0x5 -> 20 dummy bits
#               0x6 -> 24 dummy bits
#               0x7 -> 28 dummy bits
.equ	QMI_M0_WFMT_DUMMY_LEN_RESET, 0x0
.equ	QMI_M0_WFMT_DUMMY_LEN_BITS, 0x00070000
.equ	QMI_M0_WFMT_DUMMY_LEN_MSB, 18
.equ	QMI_M0_WFMT_DUMMY_LEN_LSB, 16
.equ	QMI_M0_WFMT_DUMMY_LEN_VALUE_NONE, 0x0
.equ	QMI_M0_WFMT_DUMMY_LEN_VALUE_4, 0x1
.equ	QMI_M0_WFMT_DUMMY_LEN_VALUE_8, 0x2
.equ	QMI_M0_WFMT_DUMMY_LEN_VALUE_12, 0x3
.equ	QMI_M0_WFMT_DUMMY_LEN_VALUE_16, 0x4
.equ	QMI_M0_WFMT_DUMMY_LEN_VALUE_20, 0x5
.equ	QMI_M0_WFMT_DUMMY_LEN_VALUE_24, 0x6
.equ	QMI_M0_WFMT_DUMMY_LEN_VALUE_28, 0x7
# -----------------------------------------------------------------------------
# Field       : QMI_M0_WFMT_SUFFIX_LEN
# Description : Length of post-address command suffix, in units of 4 bits.
#               (i.e. 1 cycle for quad width, 2 for dual, 4 for single)
#
#               Only values of 0 and 8 bits are supported.
#               0x0 -> No suffix
#               0x2 -> 8-bit suffix
.equ	QMI_M0_WFMT_SUFFIX_LEN_RESET, 0x0
.equ	QMI_M0_WFMT_SUFFIX_LEN_BITS, 0x0000c000
.equ	QMI_M0_WFMT_SUFFIX_LEN_MSB, 15
.equ	QMI_M0_WFMT_SUFFIX_LEN_LSB, 14
.equ	QMI_M0_WFMT_SUFFIX_LEN_VALUE_NONE, 0x0
.equ	QMI_M0_WFMT_SUFFIX_LEN_VALUE_8, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M0_WFMT_PREFIX_LEN
# Description : Length of command prefix, in units of 8 bits. (i.e. 2 cycles
#               for quad width, 4 for dual, 8 for single)
#               0x0 -> No prefix
#               0x1 -> 8-bit prefix
.equ	QMI_M0_WFMT_PREFIX_LEN_RESET, 0x1
.equ	QMI_M0_WFMT_PREFIX_LEN_BITS, 0x00001000
.equ	QMI_M0_WFMT_PREFIX_LEN_MSB, 12
.equ	QMI_M0_WFMT_PREFIX_LEN_LSB, 12
.equ	QMI_M0_WFMT_PREFIX_LEN_VALUE_NONE, 0x0
.equ	QMI_M0_WFMT_PREFIX_LEN_VALUE_8, 0x1
# -----------------------------------------------------------------------------
# Field       : QMI_M0_WFMT_DATA_WIDTH
# Description : The width used for the data transfer
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M0_WFMT_DATA_WIDTH_RESET, 0x0
.equ	QMI_M0_WFMT_DATA_WIDTH_BITS, 0x00000300
.equ	QMI_M0_WFMT_DATA_WIDTH_MSB, 9
.equ	QMI_M0_WFMT_DATA_WIDTH_LSB, 8
.equ	QMI_M0_WFMT_DATA_WIDTH_VALUE_S, 0x0
.equ	QMI_M0_WFMT_DATA_WIDTH_VALUE_D, 0x1
.equ	QMI_M0_WFMT_DATA_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M0_WFMT_DUMMY_WIDTH
# Description : The width used for the dummy phase, if any.
#
#               If width is single, SD0/MOSI is held asserted low during the
#               dummy phase, and SD1...SD3 are tristated. If width is
#               dual/quad, all IOs are tristated during the dummy phase.
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M0_WFMT_DUMMY_WIDTH_RESET, 0x0
.equ	QMI_M0_WFMT_DUMMY_WIDTH_BITS, 0x000000c0
.equ	QMI_M0_WFMT_DUMMY_WIDTH_MSB, 7
.equ	QMI_M0_WFMT_DUMMY_WIDTH_LSB, 6
.equ	QMI_M0_WFMT_DUMMY_WIDTH_VALUE_S, 0x0
.equ	QMI_M0_WFMT_DUMMY_WIDTH_VALUE_D, 0x1
.equ	QMI_M0_WFMT_DUMMY_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M0_WFMT_SUFFIX_WIDTH
# Description : The width used for the post-address command suffix, if any
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M0_WFMT_SUFFIX_WIDTH_RESET, 0x0
.equ	QMI_M0_WFMT_SUFFIX_WIDTH_BITS, 0x00000030
.equ	QMI_M0_WFMT_SUFFIX_WIDTH_MSB, 5
.equ	QMI_M0_WFMT_SUFFIX_WIDTH_LSB, 4
.equ	QMI_M0_WFMT_SUFFIX_WIDTH_VALUE_S, 0x0
.equ	QMI_M0_WFMT_SUFFIX_WIDTH_VALUE_D, 0x1
.equ	QMI_M0_WFMT_SUFFIX_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M0_WFMT_ADDR_WIDTH
# Description : The transfer width used for the address. The address phase
#               always transfers 24 bits in total.
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M0_WFMT_ADDR_WIDTH_RESET, 0x0
.equ	QMI_M0_WFMT_ADDR_WIDTH_BITS, 0x0000000c
.equ	QMI_M0_WFMT_ADDR_WIDTH_MSB, 3
.equ	QMI_M0_WFMT_ADDR_WIDTH_LSB, 2
.equ	QMI_M0_WFMT_ADDR_WIDTH_VALUE_S, 0x0
.equ	QMI_M0_WFMT_ADDR_WIDTH_VALUE_D, 0x1
.equ	QMI_M0_WFMT_ADDR_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M0_WFMT_PREFIX_WIDTH
# Description : The transfer width used for the command prefix, if any
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M0_WFMT_PREFIX_WIDTH_RESET, 0x0
.equ	QMI_M0_WFMT_PREFIX_WIDTH_BITS, 0x00000003
.equ	QMI_M0_WFMT_PREFIX_WIDTH_MSB, 1
.equ	QMI_M0_WFMT_PREFIX_WIDTH_LSB, 0
.equ	QMI_M0_WFMT_PREFIX_WIDTH_VALUE_S, 0x0
.equ	QMI_M0_WFMT_PREFIX_WIDTH_VALUE_D, 0x1
.equ	QMI_M0_WFMT_PREFIX_WIDTH_VALUE_Q, 0x2
# =============================================================================
# Register    : QMI_M0_WCMD
# Description : Command constants used for writes to memory address window 0.
#
#               The reset value of the M0_WCMD register is configured to
#               support a basic 02h serial write transfer with no additional
#               configuration.
.equ	QMI_M0_WCMD_OFFSET, 0x0000001c
.equ	QMI_M0_WCMD_BITS, 0x0000ffff
.equ	QMI_M0_WCMD_RESET, 0x0000a002
# -----------------------------------------------------------------------------
# Field       : QMI_M0_WCMD_SUFFIX
# Description : The command suffix bits following the address, if
#               Mx_WFMT_SUFFIX_LEN is nonzero.
.equ	QMI_M0_WCMD_SUFFIX_RESET, 0xa0
.equ	QMI_M0_WCMD_SUFFIX_BITS, 0x0000ff00
.equ	QMI_M0_WCMD_SUFFIX_MSB, 15
.equ	QMI_M0_WCMD_SUFFIX_LSB, 8
# -----------------------------------------------------------------------------
# Field       : QMI_M0_WCMD_PREFIX
# Description : The command prefix bits to prepend on each new transfer, if
#               Mx_WFMT_PREFIX_LEN is nonzero.
.equ	QMI_M0_WCMD_PREFIX_RESET, 0x02
.equ	QMI_M0_WCMD_PREFIX_BITS, 0x000000ff
.equ	QMI_M0_WCMD_PREFIX_MSB, 7
.equ	QMI_M0_WCMD_PREFIX_LSB, 0
# =============================================================================
# Register    : QMI_M1_TIMING
# Description : Timing configuration register for memory address window 1.
.equ	QMI_M1_TIMING_OFFSET, 0x00000020
.equ	QMI_M1_TIMING_BITS, 0xf3fff7ff
.equ	QMI_M1_TIMING_RESET, 0x40000004
# -----------------------------------------------------------------------------
# Field       : QMI_M1_TIMING_COOLDOWN
# Description : Chip select cooldown period. When a memory transfer finishes,
#               the chip select remains asserted for 64 x COOLDOWN system clock
#               cycles, plus half an SCK clock period (rounded up for odd SCK
#               divisors). After this cooldown expires, the chip select is
#               always deasserted to save power.
#
#               If the next memory access arrives within the cooldown period,
#               the QMI may be able to append more SCK cycles to the currently
#               ongoing SPI transfer, rather than starting a new transfer. This
#               reduces access latency and increases bus throughput.
#
#               Specifically, the next access must be in the same direction
#               (read/write), access the same memory window (chip select 0/1),
#               and follow sequentially the address of the last transfer. If
#               any of these are false, the new access will first deassert the
#               chip select, then begin a new transfer.
#
#               If COOLDOWN is 0, the address alignment configured by PAGEBREAK
#               has been reached, or the total chip select assertion limit
#               MAX_SELECT has been reached, the cooldown period is skipped,
#               and the chip select will always be deasserted one half SCK
#               period after the transfer finishes.
.equ	QMI_M1_TIMING_COOLDOWN_RESET, 0x1
.equ	QMI_M1_TIMING_COOLDOWN_BITS, 0xc0000000
.equ	QMI_M1_TIMING_COOLDOWN_MSB, 31
.equ	QMI_M1_TIMING_COOLDOWN_LSB, 30
# -----------------------------------------------------------------------------
# Field       : QMI_M1_TIMING_PAGEBREAK
# Description : When page break is enabled, chip select will automatically
#               deassert when crossing certain power-of-2-aligned address
#               boundaries. The next access will always begin a new read/write
#               SPI burst, even if the address of the next access follows in
#               sequence with the last access before the page boundary.
#
#               Some flash and PSRAM devices forbid crossing page boundaries
#               with a single read/write transfer, or restrict the operating
#               frequency for transfers that do cross page a boundary. This
#               option allows the QMI to safely support those devices.
#
#               This field has no effect when COOLDOWN is disabled.
#               0x0 -> No page boundary is enforced
#               0x1 -> Break bursts crossing a 256-byte page boundary
#               0x2 -> Break bursts crossing a 1024-byte quad-page boundary
#               0x3 -> Break bursts crossing a 4096-byte sector boundary
.equ	QMI_M1_TIMING_PAGEBREAK_RESET, 0x0
.equ	QMI_M1_TIMING_PAGEBREAK_BITS, 0x30000000
.equ	QMI_M1_TIMING_PAGEBREAK_MSB, 29
.equ	QMI_M1_TIMING_PAGEBREAK_LSB, 28
.equ	QMI_M1_TIMING_PAGEBREAK_VALUE_NONE, 0x0
.equ	QMI_M1_TIMING_PAGEBREAK_VALUE_256, 0x1
.equ	QMI_M1_TIMING_PAGEBREAK_VALUE_1024, 0x2
.equ	QMI_M1_TIMING_PAGEBREAK_VALUE_4096, 0x3
# -----------------------------------------------------------------------------
# Field       : QMI_M1_TIMING_SELECT_SETUP
# Description : Add up to one additional system clock cycle of setup between
#               chip select assertion and the first rising edge of SCK.
#
#               The default setup time is one half SCK period, which is usually
#               sufficient except for very high SCK frequencies with some flash
#               devices.
.equ	QMI_M1_TIMING_SELECT_SETUP_RESET, 0x0
.equ	QMI_M1_TIMING_SELECT_SETUP_BITS, 0x02000000
.equ	QMI_M1_TIMING_SELECT_SETUP_MSB, 25
.equ	QMI_M1_TIMING_SELECT_SETUP_LSB, 25
# -----------------------------------------------------------------------------
# Field       : QMI_M1_TIMING_SELECT_HOLD
# Description : Add up to three additional system clock cycles of active hold
#               between the last falling edge of SCK and the deassertion of
#               this window's chip select.
#
#               The default hold time is one system clock cycle. Note that
#               flash datasheets usually give chip select active hold time from
#               the last *rising* edge of SCK, and so even zero hold from the
#               last falling edge would be safe.
#
#               Note that this is a minimum hold time guaranteed by the QMI:
#               the actual chip select active hold may be slightly longer for
#               read transfers with low clock divisors and/or high sample
#               delays. Specifically, if the point two cycles after the last RX
#               data sample is later than the last SCK falling edge, then the
#               hold time is measured from *this* point.
#
#               Note also that, in case the final SCK pulse is masked to save
#               energy (true for non-DTR reads when COOLDOWN is disabled or
#               PAGE_BREAK is reached), all of QMI's timing logic behaves as
#               though the clock pulse were still present. The SELECT_HOLD time
#               is applied from the point where the last SCK falling edge would
#               be if the clock pulse were not masked.
.equ	QMI_M1_TIMING_SELECT_HOLD_RESET, 0x0
.equ	QMI_M1_TIMING_SELECT_HOLD_BITS, 0x01800000
.equ	QMI_M1_TIMING_SELECT_HOLD_MSB, 24
.equ	QMI_M1_TIMING_SELECT_HOLD_LSB, 23
# -----------------------------------------------------------------------------
# Field       : QMI_M1_TIMING_MAX_SELECT
# Description : Enforce a maximum assertion duration for this window's chip
#               select, in units of 64 system clock cycles. If 0, the QMI is
#               permitted to keep the chip select asserted indefinitely when
#               servicing sequential memory accesses (see COOLDOWN).
#
#               This feature is required to meet timing constraints of PSRAM
#               devices, which specify a maximum chip select assertion so they
#               can perform DRAM refresh cycles. See also MIN_DESELECT, which
#               can enforce a minimum deselect time.
#
#               If a memory access is in progress at the time MAX_SELECT is
#               reached, the QMI will wait for the access to complete before
#               deasserting the chip select. This additional time must be
#               accounted for to calculate a safe MAX_SELECT value. In the
#               worst case, this may be a fully-formed serial transfer,
#               including command prefix and address, with a data payload as
#               large as one cache line.
.equ	QMI_M1_TIMING_MAX_SELECT_RESET, 0x00
.equ	QMI_M1_TIMING_MAX_SELECT_BITS, 0x007e0000
.equ	QMI_M1_TIMING_MAX_SELECT_MSB, 22
.equ	QMI_M1_TIMING_MAX_SELECT_LSB, 17
# -----------------------------------------------------------------------------
# Field       : QMI_M1_TIMING_MIN_DESELECT
# Description : After this window's chip select is deasserted, it remains
#               deasserted for half an SCK cycle (rounded up to an integer
#               number of system clock cycles), plus MIN_DESELECT additional
#               system clock cycles, before the QMI reasserts either chip
#               select pin.
#
#               Nonzero values may be required for PSRAM devices which enforce
#               a longer minimum CS deselect time, so that they can perform
#               internal DRAM refresh cycles whilst deselected.
.equ	QMI_M1_TIMING_MIN_DESELECT_RESET, 0x00
.equ	QMI_M1_TIMING_MIN_DESELECT_BITS, 0x0001f000
.equ	QMI_M1_TIMING_MIN_DESELECT_MSB, 16
.equ	QMI_M1_TIMING_MIN_DESELECT_LSB, 12
# -----------------------------------------------------------------------------
# Field       : QMI_M1_TIMING_RXDELAY
# Description : Delay the read data sample timing, in units of one half of a
#               system clock cycle. (Not necessarily half of an SCK cycle.) An
