konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/qmi.inc
#               RXDELAY of 0 means the sample is captured at the SDI input
#               registers simultaneously with the rising edge of SCK launched
#               from the SCK output register.
#
#               At higher SCK frequencies, RXDELAY may need to be increased to
#               account for the round trip delay of the pads, and the clock-
#               to-Q delay of the QSPI memory device.
.equ	QMI_M1_TIMING_RXDELAY_RESET, 0x0
.equ	QMI_M1_TIMING_RXDELAY_BITS, 0x00000700
.equ	QMI_M1_TIMING_RXDELAY_MSB, 10
.equ	QMI_M1_TIMING_RXDELAY_LSB, 8
# -----------------------------------------------------------------------------
# Field       : QMI_M1_TIMING_CLKDIV
# Description : Clock divisor. Odd and even divisors are supported. Defines the
#               SCK clock period in units of 1 system clock cycle. Divisors
#               1..255 are encoded directly, and a divisor of 256 is encoded
#               with a value of CLKDIV=0.
#
#               The clock divisor can be changed on-the-fly, even when the QMI
#               is currently accessing memory in this address window. All other
#               parameters must only be changed when the QMI is idle.
#
#               If software is increasing CLKDIV in anticipation of an increase
#               in the system clock frequency, a dummy access to either memory
#               window (and appropriate processor barriers/fences) must be
#               inserted after the Mx_TIMING write to ensure the SCK divisor
#               change is in effect _before_ the system clock is changed.
.equ	QMI_M1_TIMING_CLKDIV_RESET, 0x04
.equ	QMI_M1_TIMING_CLKDIV_BITS, 0x000000ff
.equ	QMI_M1_TIMING_CLKDIV_MSB, 7
.equ	QMI_M1_TIMING_CLKDIV_LSB, 0
# =============================================================================
# Register    : QMI_M1_RFMT
# Description : Read transfer format configuration for memory address window 1.
#
#               Configure the bus width of each transfer phase individually,
#               and configure the length or presence of the command prefix,
#               command suffix and dummy/turnaround transfer phases. Only
#               24-bit addresses are supported.
#
#               The reset value of the M1_RFMT register is configured to
#               support a basic 03h serial read transfer with no additional
#               configuration.
.equ	QMI_M1_RFMT_OFFSET, 0x00000024
.equ	QMI_M1_RFMT_BITS, 0x1007d3ff
.equ	QMI_M1_RFMT_RESET, 0x00001000
# -----------------------------------------------------------------------------
# Field       : QMI_M1_RFMT_DTR
# Description : Enable double transfer rate (DTR) for read commands: address,
#               suffix and read data phases are active on both edges of SCK.
#               SDO data is launched centre-aligned on each SCK edge, and SDI
#               data is captured on the SCK edge that follows its launch.
#
#               DTR is implemented by halving the clock rate; SCK has a period
#               of 2 x CLK_DIV throughout the transfer. The prefix and dummy
#               phases are still single transfer rate.
#
#               If the suffix is quad-width, it must be 0 or 8 bits in length,
#               to ensure an even number of SCK edges.
.equ	QMI_M1_RFMT_DTR_RESET, 0x0
.equ	QMI_M1_RFMT_DTR_BITS, 0x10000000
.equ	QMI_M1_RFMT_DTR_MSB, 28
.equ	QMI_M1_RFMT_DTR_LSB, 28
# -----------------------------------------------------------------------------
# Field       : QMI_M1_RFMT_DUMMY_LEN
# Description : Length of dummy phase between command suffix and data phase, in
#               units of 4 bits. (i.e. 1 cycle for quad width, 2 for dual, 4
#               for single)
#               0x0 -> No dummy phase
#               0x1 -> 4 dummy bits
#               0x2 -> 8 dummy bits
#               0x3 -> 12 dummy bits
#               0x4 -> 16 dummy bits
#               0x5 -> 20 dummy bits
#               0x6 -> 24 dummy bits
#               0x7 -> 28 dummy bits
.equ	QMI_M1_RFMT_DUMMY_LEN_RESET, 0x0
.equ	QMI_M1_RFMT_DUMMY_LEN_BITS, 0x00070000
.equ	QMI_M1_RFMT_DUMMY_LEN_MSB, 18
.equ	QMI_M1_RFMT_DUMMY_LEN_LSB, 16
.equ	QMI_M1_RFMT_DUMMY_LEN_VALUE_NONE, 0x0
.equ	QMI_M1_RFMT_DUMMY_LEN_VALUE_4, 0x1
.equ	QMI_M1_RFMT_DUMMY_LEN_VALUE_8, 0x2
.equ	QMI_M1_RFMT_DUMMY_LEN_VALUE_12, 0x3
.equ	QMI_M1_RFMT_DUMMY_LEN_VALUE_16, 0x4
.equ	QMI_M1_RFMT_DUMMY_LEN_VALUE_20, 0x5
.equ	QMI_M1_RFMT_DUMMY_LEN_VALUE_24, 0x6
.equ	QMI_M1_RFMT_DUMMY_LEN_VALUE_28, 0x7
# -----------------------------------------------------------------------------
# Field       : QMI_M1_RFMT_SUFFIX_LEN
# Description : Length of post-address command suffix, in units of 4 bits.
#               (i.e. 1 cycle for quad width, 2 for dual, 4 for single)
#
#               Only values of 0 and 8 bits are supported.
#               0x0 -> No suffix
#               0x2 -> 8-bit suffix
.equ	QMI_M1_RFMT_SUFFIX_LEN_RESET, 0x0
.equ	QMI_M1_RFMT_SUFFIX_LEN_BITS, 0x0000c000
.equ	QMI_M1_RFMT_SUFFIX_LEN_MSB, 15
.equ	QMI_M1_RFMT_SUFFIX_LEN_LSB, 14
.equ	QMI_M1_RFMT_SUFFIX_LEN_VALUE_NONE, 0x0
.equ	QMI_M1_RFMT_SUFFIX_LEN_VALUE_8, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M1_RFMT_PREFIX_LEN
# Description : Length of command prefix, in units of 8 bits. (i.e. 2 cycles
#               for quad width, 4 for dual, 8 for single)
#               0x0 -> No prefix
#               0x1 -> 8-bit prefix
.equ	QMI_M1_RFMT_PREFIX_LEN_RESET, 0x1
.equ	QMI_M1_RFMT_PREFIX_LEN_BITS, 0x00001000
.equ	QMI_M1_RFMT_PREFIX_LEN_MSB, 12
.equ	QMI_M1_RFMT_PREFIX_LEN_LSB, 12
.equ	QMI_M1_RFMT_PREFIX_LEN_VALUE_NONE, 0x0
.equ	QMI_M1_RFMT_PREFIX_LEN_VALUE_8, 0x1
# -----------------------------------------------------------------------------
# Field       : QMI_M1_RFMT_DATA_WIDTH
# Description : The width used for the data transfer
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M1_RFMT_DATA_WIDTH_RESET, 0x0
.equ	QMI_M1_RFMT_DATA_WIDTH_BITS, 0x00000300
.equ	QMI_M1_RFMT_DATA_WIDTH_MSB, 9
.equ	QMI_M1_RFMT_DATA_WIDTH_LSB, 8
.equ	QMI_M1_RFMT_DATA_WIDTH_VALUE_S, 0x0
.equ	QMI_M1_RFMT_DATA_WIDTH_VALUE_D, 0x1
.equ	QMI_M1_RFMT_DATA_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M1_RFMT_DUMMY_WIDTH
# Description : The width used for the dummy phase, if any.
#
#               If width is single, SD0/MOSI is held asserted low during the
#               dummy phase, and SD1...SD3 are tristated. If width is
#               dual/quad, all IOs are tristated during the dummy phase.
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M1_RFMT_DUMMY_WIDTH_RESET, 0x0
.equ	QMI_M1_RFMT_DUMMY_WIDTH_BITS, 0x000000c0
.equ	QMI_M1_RFMT_DUMMY_WIDTH_MSB, 7
.equ	QMI_M1_RFMT_DUMMY_WIDTH_LSB, 6
.equ	QMI_M1_RFMT_DUMMY_WIDTH_VALUE_S, 0x0
.equ	QMI_M1_RFMT_DUMMY_WIDTH_VALUE_D, 0x1
.equ	QMI_M1_RFMT_DUMMY_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M1_RFMT_SUFFIX_WIDTH
# Description : The width used for the post-address command suffix, if any
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M1_RFMT_SUFFIX_WIDTH_RESET, 0x0
.equ	QMI_M1_RFMT_SUFFIX_WIDTH_BITS, 0x00000030
.equ	QMI_M1_RFMT_SUFFIX_WIDTH_MSB, 5
.equ	QMI_M1_RFMT_SUFFIX_WIDTH_LSB, 4
.equ	QMI_M1_RFMT_SUFFIX_WIDTH_VALUE_S, 0x0
.equ	QMI_M1_RFMT_SUFFIX_WIDTH_VALUE_D, 0x1
.equ	QMI_M1_RFMT_SUFFIX_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M1_RFMT_ADDR_WIDTH
# Description : The transfer width used for the address. The address phase
#               always transfers 24 bits in total.
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M1_RFMT_ADDR_WIDTH_RESET, 0x0
.equ	QMI_M1_RFMT_ADDR_WIDTH_BITS, 0x0000000c
.equ	QMI_M1_RFMT_ADDR_WIDTH_MSB, 3
.equ	QMI_M1_RFMT_ADDR_WIDTH_LSB, 2
.equ	QMI_M1_RFMT_ADDR_WIDTH_VALUE_S, 0x0
.equ	QMI_M1_RFMT_ADDR_WIDTH_VALUE_D, 0x1
.equ	QMI_M1_RFMT_ADDR_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M1_RFMT_PREFIX_WIDTH
# Description : The transfer width used for the command prefix, if any
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M1_RFMT_PREFIX_WIDTH_RESET, 0x0
.equ	QMI_M1_RFMT_PREFIX_WIDTH_BITS, 0x00000003
.equ	QMI_M1_RFMT_PREFIX_WIDTH_MSB, 1
.equ	QMI_M1_RFMT_PREFIX_WIDTH_LSB, 0
.equ	QMI_M1_RFMT_PREFIX_WIDTH_VALUE_S, 0x0
.equ	QMI_M1_RFMT_PREFIX_WIDTH_VALUE_D, 0x1
.equ	QMI_M1_RFMT_PREFIX_WIDTH_VALUE_Q, 0x2
# =============================================================================
# Register    : QMI_M1_RCMD
# Description : Command constants used for reads from memory address window 1.
#
#               The reset value of the M1_RCMD register is configured to
#               support a basic 03h serial read transfer with no additional
#               configuration.
.equ	QMI_M1_RCMD_OFFSET, 0x00000028
.equ	QMI_M1_RCMD_BITS, 0x0000ffff
.equ	QMI_M1_RCMD_RESET, 0x0000a003
# -----------------------------------------------------------------------------
# Field       : QMI_M1_RCMD_SUFFIX
# Description : The command suffix bits following the address, if
#               Mx_RFMT_SUFFIX_LEN is nonzero.
.equ	QMI_M1_RCMD_SUFFIX_RESET, 0xa0
.equ	QMI_M1_RCMD_SUFFIX_BITS, 0x0000ff00
.equ	QMI_M1_RCMD_SUFFIX_MSB, 15
.equ	QMI_M1_RCMD_SUFFIX_LSB, 8
# -----------------------------------------------------------------------------
# Field       : QMI_M1_RCMD_PREFIX
# Description : The command prefix bits to prepend on each new transfer, if
#               Mx_RFMT_PREFIX_LEN is nonzero.
.equ	QMI_M1_RCMD_PREFIX_RESET, 0x03
.equ	QMI_M1_RCMD_PREFIX_BITS, 0x000000ff
.equ	QMI_M1_RCMD_PREFIX_MSB, 7
.equ	QMI_M1_RCMD_PREFIX_LSB, 0
# =============================================================================
# Register    : QMI_M1_WFMT
# Description : Write transfer format configuration for memory address window
#               1.
#
#               Configure the bus width of each transfer phase individually,
#               and configure the length or presence of the command prefix,
#               command suffix and dummy/turnaround transfer phases. Only
#               24-bit addresses are supported.
#
#               The reset value of the M1_WFMT register is configured to
#               support a basic 02h serial write transfer. However, writes to
#               this window must first be enabled via the XIP_CTRL_WRITABLE_M1
#               bit, as XIP memory is read-only by default.
.equ	QMI_M1_WFMT_OFFSET, 0x0000002c
.equ	QMI_M1_WFMT_BITS, 0x1007d3ff
.equ	QMI_M1_WFMT_RESET, 0x00001000
# -----------------------------------------------------------------------------
# Field       : QMI_M1_WFMT_DTR
# Description : Enable double transfer rate (DTR) for write commands: address,
#               suffix and write data phases are active on both edges of SCK.
#               SDO data is launched centre-aligned on each SCK edge, and SDI
#               data is captured on the SCK edge that follows its launch.
#
#               DTR is implemented by halving the clock rate; SCK has a period
#               of 2 x CLK_DIV throughout the transfer. The prefix and dummy
#               phases are still single transfer rate.
#
#               If the suffix is quad-width, it must be 0 or 8 bits in length,
#               to ensure an even number of SCK edges.
.equ	QMI_M1_WFMT_DTR_RESET, 0x0
.equ	QMI_M1_WFMT_DTR_BITS, 0x10000000
.equ	QMI_M1_WFMT_DTR_MSB, 28
.equ	QMI_M1_WFMT_DTR_LSB, 28
# -----------------------------------------------------------------------------
# Field       : QMI_M1_WFMT_DUMMY_LEN
# Description : Length of dummy phase between command suffix and data phase, in
#               units of 4 bits. (i.e. 1 cycle for quad width, 2 for dual, 4
#               for single)
#               0x0 -> No dummy phase
#               0x1 -> 4 dummy bits
#               0x2 -> 8 dummy bits
#               0x3 -> 12 dummy bits
#               0x4 -> 16 dummy bits
#               0x5 -> 20 dummy bits
#               0x6 -> 24 dummy bits
#               0x7 -> 28 dummy bits
.equ	QMI_M1_WFMT_DUMMY_LEN_RESET, 0x0
.equ	QMI_M1_WFMT_DUMMY_LEN_BITS, 0x00070000
.equ	QMI_M1_WFMT_DUMMY_LEN_MSB, 18
.equ	QMI_M1_WFMT_DUMMY_LEN_LSB, 16
.equ	QMI_M1_WFMT_DUMMY_LEN_VALUE_NONE, 0x0
.equ	QMI_M1_WFMT_DUMMY_LEN_VALUE_4, 0x1
.equ	QMI_M1_WFMT_DUMMY_LEN_VALUE_8, 0x2
.equ	QMI_M1_WFMT_DUMMY_LEN_VALUE_12, 0x3
.equ	QMI_M1_WFMT_DUMMY_LEN_VALUE_16, 0x4
.equ	QMI_M1_WFMT_DUMMY_LEN_VALUE_20, 0x5
.equ	QMI_M1_WFMT_DUMMY_LEN_VALUE_24, 0x6
.equ	QMI_M1_WFMT_DUMMY_LEN_VALUE_28, 0x7
# -----------------------------------------------------------------------------
# Field       : QMI_M1_WFMT_SUFFIX_LEN
# Description : Length of post-address command suffix, in units of 4 bits.
#               (i.e. 1 cycle for quad width, 2 for dual, 4 for single)
#
#               Only values of 0 and 8 bits are supported.
#               0x0 -> No suffix
#               0x2 -> 8-bit suffix
.equ	QMI_M1_WFMT_SUFFIX_LEN_RESET, 0x0
.equ	QMI_M1_WFMT_SUFFIX_LEN_BITS, 0x0000c000
.equ	QMI_M1_WFMT_SUFFIX_LEN_MSB, 15
.equ	QMI_M1_WFMT_SUFFIX_LEN_LSB, 14
.equ	QMI_M1_WFMT_SUFFIX_LEN_VALUE_NONE, 0x0
.equ	QMI_M1_WFMT_SUFFIX_LEN_VALUE_8, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M1_WFMT_PREFIX_LEN
# Description : Length of command prefix, in units of 8 bits. (i.e. 2 cycles
#               for quad width, 4 for dual, 8 for single)
#               0x0 -> No prefix
#               0x1 -> 8-bit prefix
.equ	QMI_M1_WFMT_PREFIX_LEN_RESET, 0x1
.equ	QMI_M1_WFMT_PREFIX_LEN_BITS, 0x00001000
.equ	QMI_M1_WFMT_PREFIX_LEN_MSB, 12
.equ	QMI_M1_WFMT_PREFIX_LEN_LSB, 12
.equ	QMI_M1_WFMT_PREFIX_LEN_VALUE_NONE, 0x0
.equ	QMI_M1_WFMT_PREFIX_LEN_VALUE_8, 0x1
# -----------------------------------------------------------------------------
# Field       : QMI_M1_WFMT_DATA_WIDTH
# Description : The width used for the data transfer
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M1_WFMT_DATA_WIDTH_RESET, 0x0
.equ	QMI_M1_WFMT_DATA_WIDTH_BITS, 0x00000300
.equ	QMI_M1_WFMT_DATA_WIDTH_MSB, 9
.equ	QMI_M1_WFMT_DATA_WIDTH_LSB, 8
.equ	QMI_M1_WFMT_DATA_WIDTH_VALUE_S, 0x0
.equ	QMI_M1_WFMT_DATA_WIDTH_VALUE_D, 0x1
.equ	QMI_M1_WFMT_DATA_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M1_WFMT_DUMMY_WIDTH
# Description : The width used for the dummy phase, if any.
#
#               If width is single, SD0/MOSI is held asserted low during the
#               dummy phase, and SD1...SD3 are tristated. If width is
#               dual/quad, all IOs are tristated during the dummy phase.
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M1_WFMT_DUMMY_WIDTH_RESET, 0x0
.equ	QMI_M1_WFMT_DUMMY_WIDTH_BITS, 0x000000c0
.equ	QMI_M1_WFMT_DUMMY_WIDTH_MSB, 7
.equ	QMI_M1_WFMT_DUMMY_WIDTH_LSB, 6
.equ	QMI_M1_WFMT_DUMMY_WIDTH_VALUE_S, 0x0
.equ	QMI_M1_WFMT_DUMMY_WIDTH_VALUE_D, 0x1
.equ	QMI_M1_WFMT_DUMMY_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M1_WFMT_SUFFIX_WIDTH
# Description : The width used for the post-address command suffix, if any
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M1_WFMT_SUFFIX_WIDTH_RESET, 0x0
.equ	QMI_M1_WFMT_SUFFIX_WIDTH_BITS, 0x00000030
.equ	QMI_M1_WFMT_SUFFIX_WIDTH_MSB, 5
.equ	QMI_M1_WFMT_SUFFIX_WIDTH_LSB, 4
.equ	QMI_M1_WFMT_SUFFIX_WIDTH_VALUE_S, 0x0
.equ	QMI_M1_WFMT_SUFFIX_WIDTH_VALUE_D, 0x1
.equ	QMI_M1_WFMT_SUFFIX_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M1_WFMT_ADDR_WIDTH
# Description : The transfer width used for the address. The address phase
#               always transfers 24 bits in total.
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M1_WFMT_ADDR_WIDTH_RESET, 0x0
.equ	QMI_M1_WFMT_ADDR_WIDTH_BITS, 0x0000000c
.equ	QMI_M1_WFMT_ADDR_WIDTH_MSB, 3
.equ	QMI_M1_WFMT_ADDR_WIDTH_LSB, 2
.equ	QMI_M1_WFMT_ADDR_WIDTH_VALUE_S, 0x0
.equ	QMI_M1_WFMT_ADDR_WIDTH_VALUE_D, 0x1
.equ	QMI_M1_WFMT_ADDR_WIDTH_VALUE_Q, 0x2
# -----------------------------------------------------------------------------
# Field       : QMI_M1_WFMT_PREFIX_WIDTH
# Description : The transfer width used for the command prefix, if any
#               0x0 -> Single width
#               0x1 -> Dual width
#               0x2 -> Quad width
.equ	QMI_M1_WFMT_PREFIX_WIDTH_RESET, 0x0
.equ	QMI_M1_WFMT_PREFIX_WIDTH_BITS, 0x00000003
.equ	QMI_M1_WFMT_PREFIX_WIDTH_MSB, 1
.equ	QMI_M1_WFMT_PREFIX_WIDTH_LSB, 0
.equ	QMI_M1_WFMT_PREFIX_WIDTH_VALUE_S, 0x0
.equ	QMI_M1_WFMT_PREFIX_WIDTH_VALUE_D, 0x1
.equ	QMI_M1_WFMT_PREFIX_WIDTH_VALUE_Q, 0x2
# =============================================================================
# Register    : QMI_M1_WCMD
# Description : Command constants used for writes to memory address window 1.
#
#               The reset value of the M1_WCMD register is configured to
#               support a basic 02h serial write transfer with no additional
#               configuration.
.equ	QMI_M1_WCMD_OFFSET, 0x00000030
.equ	QMI_M1_WCMD_BITS, 0x0000ffff
.equ	QMI_M1_WCMD_RESET, 0x0000a002
# -----------------------------------------------------------------------------
# Field       : QMI_M1_WCMD_SUFFIX
# Description : The command suffix bits following the address, if
#               Mx_WFMT_SUFFIX_LEN is nonzero.
.equ	QMI_M1_WCMD_SUFFIX_RESET, 0xa0
.equ	QMI_M1_WCMD_SUFFIX_BITS, 0x0000ff00
.equ	QMI_M1_WCMD_SUFFIX_MSB, 15
.equ	QMI_M1_WCMD_SUFFIX_LSB, 8
# -----------------------------------------------------------------------------
# Field       : QMI_M1_WCMD_PREFIX
# Description : The command prefix bits to prepend on each new transfer, if
#               Mx_WFMT_PREFIX_LEN is nonzero.
.equ	QMI_M1_WCMD_PREFIX_RESET, 0x02
.equ	QMI_M1_WCMD_PREFIX_BITS, 0x000000ff
.equ	QMI_M1_WCMD_PREFIX_MSB, 7
.equ	QMI_M1_WCMD_PREFIX_LSB, 0
# =============================================================================
# Register    : QMI_ATRANS0
# Description : Configure address translation for XIP virtual addresses
#               0x000000 through 0x3fffff (a 4 MiB window starting at +0 MiB).
#
#               Address translation allows a program image to be executed in
#               place at multiple physical flash addresses (for example, a
#               double-buffered flash image for over-the-air updates), without
#               the overhead of position-independent code.
#
#               At reset, the address translation registers are initialised to
#               an identity mapping, so that they can be ignored if address
#               translation is not required.
#
#               Note that the XIP cache is fully virtually addressed, so a
#               cache flush is required after changing the address translation.
.equ	QMI_ATRANS0_OFFSET, 0x00000034
.equ	QMI_ATRANS0_BITS, 0x07ff0fff
.equ	QMI_ATRANS0_RESET, 0x04000000
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS0_SIZE
# Description : Translation aperture size for this virtual address range, in
#               units of 4 kiB (one flash sector).
#
#               Bits 21:12 of the virtual address are compared to SIZE. Offsets
#               greater than SIZE return a bus error, and do not cause a QSPI
#               access.
.equ	QMI_ATRANS0_SIZE_RESET, 0x400
.equ	QMI_ATRANS0_SIZE_BITS, 0x07ff0000
.equ	QMI_ATRANS0_SIZE_MSB, 26
.equ	QMI_ATRANS0_SIZE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS0_BASE
# Description : Physical address base for this virtual address range, in units
#               of 4 kiB (one flash sector).
#
#               Taking a 24-bit virtual address, firstly bits 23:22 (the two
#               MSBs) are masked to zero, and then BASE is added to bits 23:12
#               (the upper 12 bits) to form the physical address. Translation
#               wraps on a 16 MiB boundary.
.equ	QMI_ATRANS0_BASE_RESET, 0x000
.equ	QMI_ATRANS0_BASE_BITS, 0x00000fff
.equ	QMI_ATRANS0_BASE_MSB, 11
.equ	QMI_ATRANS0_BASE_LSB, 0
# =============================================================================
# Register    : QMI_ATRANS1
# Description : Configure address translation for XIP virtual addresses
#               0x400000 through 0x7fffff (a 4 MiB window starting at +4 MiB).
#
#               Address translation allows a program image to be executed in
#               place at multiple physical flash addresses (for example, a
#               double-buffered flash image for over-the-air updates), without
#               the overhead of position-independent code.
#
#               At reset, the address translation registers are initialised to
#               an identity mapping, so that they can be ignored if address
#               translation is not required.
#
#               Note that the XIP cache is fully virtually addressed, so a
#               cache flush is required after changing the address translation.
.equ	QMI_ATRANS1_OFFSET, 0x00000038
.equ	QMI_ATRANS1_BITS, 0x07ff0fff
.equ	QMI_ATRANS1_RESET, 0x04000400
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS1_SIZE
# Description : Translation aperture size for this virtual address range, in
#               units of 4 kiB (one flash sector).
#
#               Bits 21:12 of the virtual address are compared to SIZE. Offsets
#               greater than SIZE return a bus error, and do not cause a QSPI
#               access.
.equ	QMI_ATRANS1_SIZE_RESET, 0x400
.equ	QMI_ATRANS1_SIZE_BITS, 0x07ff0000
.equ	QMI_ATRANS1_SIZE_MSB, 26
.equ	QMI_ATRANS1_SIZE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS1_BASE
# Description : Physical address base for this virtual address range, in units
#               of 4 kiB (one flash sector).
#
#               Taking a 24-bit virtual address, firstly bits 23:22 (the two
#               MSBs) are masked to zero, and then BASE is added to bits 23:12
#               (the upper 12 bits) to form the physical address. Translation
#               wraps on a 16 MiB boundary.
.equ	QMI_ATRANS1_BASE_RESET, 0x400
.equ	QMI_ATRANS1_BASE_BITS, 0x00000fff
.equ	QMI_ATRANS1_BASE_MSB, 11
.equ	QMI_ATRANS1_BASE_LSB, 0
# =============================================================================
# Register    : QMI_ATRANS2
# Description : Configure address translation for XIP virtual addresses
#               0x800000 through 0xbfffff (a 4 MiB window starting at +8 MiB).
#
#               Address translation allows a program image to be executed in
#               place at multiple physical flash addresses (for example, a
#               double-buffered flash image for over-the-air updates), without
#               the overhead of position-independent code.
#
#               At reset, the address translation registers are initialised to
#               an identity mapping, so that they can be ignored if address
#               translation is not required.
#
#               Note that the XIP cache is fully virtually addressed, so a
#               cache flush is required after changing the address translation.
.equ	QMI_ATRANS2_OFFSET, 0x0000003c
.equ	QMI_ATRANS2_BITS, 0x07ff0fff
.equ	QMI_ATRANS2_RESET, 0x04000800
# -----------------------------------------------------------------------------
