konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/qmi.inc
# Field       : QMI_ATRANS2_SIZE
# Description : Translation aperture size for this virtual address range, in
#               units of 4 kiB (one flash sector).
#
#               Bits 21:12 of the virtual address are compared to SIZE. Offsets
#               greater than SIZE return a bus error, and do not cause a QSPI
#               access.
.equ	QMI_ATRANS2_SIZE_RESET, 0x400
.equ	QMI_ATRANS2_SIZE_BITS, 0x07ff0000
.equ	QMI_ATRANS2_SIZE_MSB, 26
.equ	QMI_ATRANS2_SIZE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS2_BASE
# Description : Physical address base for this virtual address range, in units
#               of 4 kiB (one flash sector).
#
#               Taking a 24-bit virtual address, firstly bits 23:22 (the two
#               MSBs) are masked to zero, and then BASE is added to bits 23:12
#               (the upper 12 bits) to form the physical address. Translation
#               wraps on a 16 MiB boundary.
.equ	QMI_ATRANS2_BASE_RESET, 0x800
.equ	QMI_ATRANS2_BASE_BITS, 0x00000fff
.equ	QMI_ATRANS2_BASE_MSB, 11
.equ	QMI_ATRANS2_BASE_LSB, 0
# =============================================================================
# Register    : QMI_ATRANS3
# Description : Configure address translation for XIP virtual addresses
#               0xc00000 through 0xffffff (a 4 MiB window starting at +12 MiB).
#
#               Address translation allows a program image to be executed in
#               place at multiple physical flash addresses (for example, a
#               double-buffered flash image for over-the-air updates), without
#               the overhead of position-independent code.
#
#               At reset, the address translation registers are initialised to
#               an identity mapping, so that they can be ignored if address
#               translation is not required.
#
#               Note that the XIP cache is fully virtually addressed, so a
#               cache flush is required after changing the address translation.
.equ	QMI_ATRANS3_OFFSET, 0x00000040
.equ	QMI_ATRANS3_BITS, 0x07ff0fff
.equ	QMI_ATRANS3_RESET, 0x04000c00
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS3_SIZE
# Description : Translation aperture size for this virtual address range, in
#               units of 4 kiB (one flash sector).
#
#               Bits 21:12 of the virtual address are compared to SIZE. Offsets
#               greater than SIZE return a bus error, and do not cause a QSPI
#               access.
.equ	QMI_ATRANS3_SIZE_RESET, 0x400
.equ	QMI_ATRANS3_SIZE_BITS, 0x07ff0000
.equ	QMI_ATRANS3_SIZE_MSB, 26
.equ	QMI_ATRANS3_SIZE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS3_BASE
# Description : Physical address base for this virtual address range, in units
#               of 4 kiB (one flash sector).
#
#               Taking a 24-bit virtual address, firstly bits 23:22 (the two
#               MSBs) are masked to zero, and then BASE is added to bits 23:12
#               (the upper 12 bits) to form the physical address. Translation
#               wraps on a 16 MiB boundary.
.equ	QMI_ATRANS3_BASE_RESET, 0xc00
.equ	QMI_ATRANS3_BASE_BITS, 0x00000fff
.equ	QMI_ATRANS3_BASE_MSB, 11
.equ	QMI_ATRANS3_BASE_LSB, 0
# =============================================================================
# Register    : QMI_ATRANS4
# Description : Configure address translation for XIP virtual addresses
#               0x1000000 through 0x13fffff (a 4 MiB window starting at +16
#               MiB).
#
#               Address translation allows a program image to be executed in
#               place at multiple physical flash addresses (for example, a
#               double-buffered flash image for over-the-air updates), without
#               the overhead of position-independent code.
#
#               At reset, the address translation registers are initialised to
#               an identity mapping, so that they can be ignored if address
#               translation is not required.
#
#               Note that the XIP cache is fully virtually addressed, so a
#               cache flush is required after changing the address translation.
.equ	QMI_ATRANS4_OFFSET, 0x00000044
.equ	QMI_ATRANS4_BITS, 0x07ff0fff
.equ	QMI_ATRANS4_RESET, 0x04000000
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS4_SIZE
# Description : Translation aperture size for this virtual address range, in
#               units of 4 kiB (one flash sector).
#
#               Bits 21:12 of the virtual address are compared to SIZE. Offsets
#               greater than SIZE return a bus error, and do not cause a QSPI
#               access.
.equ	QMI_ATRANS4_SIZE_RESET, 0x400
.equ	QMI_ATRANS4_SIZE_BITS, 0x07ff0000
.equ	QMI_ATRANS4_SIZE_MSB, 26
.equ	QMI_ATRANS4_SIZE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS4_BASE
# Description : Physical address base for this virtual address range, in units
#               of 4 kiB (one flash sector).
#
#               Taking a 24-bit virtual address, firstly bits 23:22 (the two
#               MSBs) are masked to zero, and then BASE is added to bits 23:12
#               (the upper 12 bits) to form the physical address. Translation
#               wraps on a 16 MiB boundary.
.equ	QMI_ATRANS4_BASE_RESET, 0x000
.equ	QMI_ATRANS4_BASE_BITS, 0x00000fff
.equ	QMI_ATRANS4_BASE_MSB, 11
.equ	QMI_ATRANS4_BASE_LSB, 0
# =============================================================================
# Register    : QMI_ATRANS5
# Description : Configure address translation for XIP virtual addresses
#               0x1400000 through 0x17fffff (a 4 MiB window starting at +20
#               MiB).
#
#               Address translation allows a program image to be executed in
#               place at multiple physical flash addresses (for example, a
#               double-buffered flash image for over-the-air updates), without
#               the overhead of position-independent code.
#
#               At reset, the address translation registers are initialised to
#               an identity mapping, so that they can be ignored if address
#               translation is not required.
#
#               Note that the XIP cache is fully virtually addressed, so a
#               cache flush is required after changing the address translation.
.equ	QMI_ATRANS5_OFFSET, 0x00000048
.equ	QMI_ATRANS5_BITS, 0x07ff0fff
.equ	QMI_ATRANS5_RESET, 0x04000400
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS5_SIZE
# Description : Translation aperture size for this virtual address range, in
#               units of 4 kiB (one flash sector).
#
#               Bits 21:12 of the virtual address are compared to SIZE. Offsets
#               greater than SIZE return a bus error, and do not cause a QSPI
#               access.
.equ	QMI_ATRANS5_SIZE_RESET, 0x400
.equ	QMI_ATRANS5_SIZE_BITS, 0x07ff0000
.equ	QMI_ATRANS5_SIZE_MSB, 26
.equ	QMI_ATRANS5_SIZE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS5_BASE
# Description : Physical address base for this virtual address range, in units
#               of 4 kiB (one flash sector).
#
#               Taking a 24-bit virtual address, firstly bits 23:22 (the two
#               MSBs) are masked to zero, and then BASE is added to bits 23:12
#               (the upper 12 bits) to form the physical address. Translation
#               wraps on a 16 MiB boundary.
.equ	QMI_ATRANS5_BASE_RESET, 0x400
.equ	QMI_ATRANS5_BASE_BITS, 0x00000fff
.equ	QMI_ATRANS5_BASE_MSB, 11
.equ	QMI_ATRANS5_BASE_LSB, 0
# =============================================================================
# Register    : QMI_ATRANS6
# Description : Configure address translation for XIP virtual addresses
#               0x1800000 through 0x1bfffff (a 4 MiB window starting at +24
#               MiB).
#
#               Address translation allows a program image to be executed in
#               place at multiple physical flash addresses (for example, a
#               double-buffered flash image for over-the-air updates), without
#               the overhead of position-independent code.
#
#               At reset, the address translation registers are initialised to
#               an identity mapping, so that they can be ignored if address
#               translation is not required.
#
#               Note that the XIP cache is fully virtually addressed, so a
#               cache flush is required after changing the address translation.
.equ	QMI_ATRANS6_OFFSET, 0x0000004c
.equ	QMI_ATRANS6_BITS, 0x07ff0fff
.equ	QMI_ATRANS6_RESET, 0x04000800
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS6_SIZE
# Description : Translation aperture size for this virtual address range, in
#               units of 4 kiB (one flash sector).
#
#               Bits 21:12 of the virtual address are compared to SIZE. Offsets
#               greater than SIZE return a bus error, and do not cause a QSPI
#               access.
.equ	QMI_ATRANS6_SIZE_RESET, 0x400
.equ	QMI_ATRANS6_SIZE_BITS, 0x07ff0000
.equ	QMI_ATRANS6_SIZE_MSB, 26
.equ	QMI_ATRANS6_SIZE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS6_BASE
# Description : Physical address base for this virtual address range, in units
#               of 4 kiB (one flash sector).
#
#               Taking a 24-bit virtual address, firstly bits 23:22 (the two
#               MSBs) are masked to zero, and then BASE is added to bits 23:12
#               (the upper 12 bits) to form the physical address. Translation
#               wraps on a 16 MiB boundary.
.equ	QMI_ATRANS6_BASE_RESET, 0x800
.equ	QMI_ATRANS6_BASE_BITS, 0x00000fff
.equ	QMI_ATRANS6_BASE_MSB, 11
.equ	QMI_ATRANS6_BASE_LSB, 0
# =============================================================================
# Register    : QMI_ATRANS7
# Description : Configure address translation for XIP virtual addresses
#               0x1c00000 through 0x1ffffff (a 4 MiB window starting at +28
#               MiB).
#
#               Address translation allows a program image to be executed in
#               place at multiple physical flash addresses (for example, a
#               double-buffered flash image for over-the-air updates), without
#               the overhead of position-independent code.
#
#               At reset, the address translation registers are initialised to
#               an identity mapping, so that they can be ignored if address
#               translation is not required.
#
#               Note that the XIP cache is fully virtually addressed, so a
#               cache flush is required after changing the address translation.
.equ	QMI_ATRANS7_OFFSET, 0x00000050
.equ	QMI_ATRANS7_BITS, 0x07ff0fff
.equ	QMI_ATRANS7_RESET, 0x04000c00
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS7_SIZE
# Description : Translation aperture size for this virtual address range, in
#               units of 4 kiB (one flash sector).
#
#               Bits 21:12 of the virtual address are compared to SIZE. Offsets
#               greater than SIZE return a bus error, and do not cause a QSPI
#               access.
.equ	QMI_ATRANS7_SIZE_RESET, 0x400
.equ	QMI_ATRANS7_SIZE_BITS, 0x07ff0000
.equ	QMI_ATRANS7_SIZE_MSB, 26
.equ	QMI_ATRANS7_SIZE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : QMI_ATRANS7_BASE
# Description : Physical address base for this virtual address range, in units
#               of 4 kiB (one flash sector).
#
#               Taking a 24-bit virtual address, firstly bits 23:22 (the two
#               MSBs) are masked to zero, and then BASE is added to bits 23:12
#               (the upper 12 bits) to form the physical address. Translation
#               wraps on a 16 MiB boundary.
.equ	QMI_ATRANS7_BASE_RESET, 0xc00
.equ	QMI_ATRANS7_BASE_BITS, 0x00000fff
.equ	QMI_ATRANS7_BASE_MSB, 11
.equ	QMI_ATRANS7_BASE_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_QMI_H
